{
  "exam_id": "k_angol_2025_maj",
  "subject": "Angol",
  "level": "Középszintű",
  "year": "2025 május",
  "reading_passages": {
    "task_1_driving_school_answers": "FREQUENTLY ASKED QUESTIONS\nHere are answers to common questions we get.\n0) Yes, you must be at least 17 years old to start learning to drive a car.\n1) On average, one needs between 20 and 40 hours of professional instruction to become test ready, but every learner is different. Some may need more, while others may need fewer lessons.\n2) It is possible but it depends on your instructor. Certain driving instructors only teach in their own cars, which are fitted with dual controls: a set of extra pedals on the passenger's side, allowing the instructor to assist in emergencies.\n3) Driving lessons during the daytime are the best choice because more instructors are available and there's better visibility than in the evenings.\n4) Yes, as long as the requested location is within our working area, and provided this is arranged with your instructor well before your lesson.\n5) It's recommended to take at least one or two lessons per week to maintain progress and remember information.\n6) Certainly. You can view our instructors' profiles on our website including a short bio about them and a picture of the car you'll learn to drive in.\n7) Take note of the examiner's feedback and discuss it with your instructor. Focus on practising the areas where you need to improve before retaking the test.\n8) They are signs that must be displayed on the front and back of a vehicle when a learner driver is behind the wheel. They indicate that the driver is still learning.",
    "task_2_dog_christmas": "WHAT YOU SHOULDN'T BE FEEDING YOUR DOG AT CHRISTMAS\nMany popular foods that people eat at Christmas are unsafe for dogs and shouldn't (0) be fed to them. Cats and dogs have different digestive systems to us humans. Things we can digest, they might struggle to, so we need to be careful to (9) avoid giving them certain things. So, what should be avoided and how can you make the holiday season special for your pets?\nChocolate contains theobromine, which is toxic to cats and dogs and causes stomach pain, vomiting, or heart problems. Dark chocolate (10) contains higher doses and is regarded as more toxic. Chocolate also contains caffeine, which causes pets to become restless and (11) have difficulty breathing.\nMince pies might be one of the most common festive treats, but they contain raisins, which are highly toxic to dogs. Your dog may develop severe symptoms soon after eating them. It's not known what effect they have on cats, but vets (12) advise keeping these out of their reach.\nRaw garlic and onions can (13) cause stomach problems for your pets if they eat them in large quantities. Best to keep these on your plate so you don't cause any upset tummies.\nIf you're having turkey or chicken for dinner this Christmas, chances are there'll be some bones around. Don't give these to your pets though! Cooked bones aren't suitable for your cat or dog as they can (14) break into sharp pieces which might cause damage to their insides.\nExperts suggest that rather than always looking for foodie treats, you should (15) get your dog an active present. They recommend a nice new toy or a lovely long walk. If you want to have some surprises, just (16) hide your dog's usual biscuits in leftover boxes and let them sniff them out!",
    "task_3_uni_tips": "TIPS FOR LOOKING AFTER YOURSELF AT UNIVERSITY\n0) When you're starting uni, looking after yourself can be tough. It's scary being away from home in a new place with people you don't know well yet. Or maybe your course is super challenging. These tips can help you look after your mental health.\n17) Talk to someone you know well and trust. It's important not to struggle in silence. Opening up can be difficult but remember you're not alone. Schedule regular chats with family or friends back home.\n18) Find out what support your uni offers. Most universities have helplines and counselling services. Search on the website to find out what is available at your university.\n19) Register at the nearest surgery. Even if you don't need a doctor right now, it's a good idea to contact one so you can get help when you need it.\n20) Stick to a basic routine. This is especially important when everything is changing. Try to sleep enough, eat a balanced diet, and exercise when you can. These small things make a big difference to your mental health.\n21) Find a balance between study and life. Take breaks away from your desk, when you do something fun. Uni is about enjoying yourself as well as studying.\n22) Reflect on your emotions. If writing is your thing, keeping a diary will be helpful to track how you're feeling.\n23) Try to make new friends. It's normal to find it hard to socialize at first but keep trying. Try setting up fun activities with your housemates like game nights or watching a show together. You could also join a society to meet people.",
    "task_4_oldest_couple": "When Marjorie Fiterman and Bernie Littman met in their 90s, they had already lived long, full lives and neither of them thought they'd fall in love or end up married again. But last May, the two became the world's oldest married couple, with a combined age of over 202 years.\nMs. Fiterman is 102 years old, and Mr. Littman is 100. He was an engineer, and she was a teacher. Each of them had spent more than 60 years in their first marriages, but after their partners died, they both moved to the same retirement home in Philadelphia. They met at a costume party and quickly became friends because they had several things in common. They both liked acting in plays at the retirement home, enjoyed sharing meals together and they'd both attended the University of Pennsylvania at the same time, though they didn't meet each other then.\nMr. Littman will always have an easy way to remember when they had their first date – it was the same day that one of his great-granddaughters was born. His family was happy that he'd found someone he fell in love with. Although the couple dated for nine years, the family never thought that the two might want to get married.\nThe wedding ceremony took place at the retirement home where they live. Three generations of Mr. Littman's family were there with the couple: his children, grandchildren and great-grandchildren. On the day they got married, the couple's ages added up to 202 years and 271 days. That broke the Guinness world record for the oldest couple to get married.\nThey say their secret is that they keep each other young."
  },
  "listening_transcripts": {
    "task_1_greeter": "67-year old Charles was a retired soldier. He was also a new employee at the local supermarket, a so-called retiree-greeter, whose job was to wait at the front door of the store and greet all shoppers who entered. He really enjoyed his new job, but there was one big problem: he had to get up extremely early in the morning, at 5 o'clock, because his day shift started at 6:30, and he just couldn't seem to get to work on time. Every day he was 5, 10, 15 minutes late.\nBut in many important respects, Charles was an outstandingly good worker, really kind and tidy, intelligent, good-looking and obviously demonstrating the store's customer friendly policies. One day, when he was late again, the boss decided to call him into his office for a talk.\n\"Charles, I like your work ethic and professionalism, you really do a great job when you finally get here, but your being late so often is quite annoying and irritating.\"\n\"Yes sir, I know, and I am working on it.\"\n\"Well, good, you are a team player. That's what I like to hear.\"\n\"Yes sir, I understand your concern, and I'll try harder.\"\nA bit surprised, the manager went on to comment,\n\"It's odd though, you coming in late. I know you're retired from the Armed Forces. What did they say to you there if you showed up in the morning so late and so often?\"\nThe old man looked down at the floor, chuckled, and said with a polite smile on his face,\n\"Well, quite honestly, they usually just saluted and said: 'Good morning General, can I get your coffee, sir?'",
    "task_2_porsche": "A 17-year-old boy, who worked part-time at a fast food restaurant, drove up to park in front of the house in a beautiful Porsche.\nNaturally, his parents knew that there was no way he earned enough with his after-school job to buy such a car.\n\"Where did you get that car?” his mom and dad screamed in shock.\n\"I bought it today,” replied the teen calmly.\n“With what money young man?” his mom demanded. “We know how much a Porsche costs and you cannot afford it!\"\n\"Well, it's used and I got a good deal,” said the boy, “This one cost me 20 dollars.\"\n\"Who on earth would sell a car like that for 20 dollars?!\"\n\"The woman up the street,\" the boy replied. “I don't know her name she's just moved in. She ordered a pizza and when I delivered it to her, she asked me if I wanted to buy a Porsche for 20 dollars.\"\nThe boy's dad and mom hurried over to their new neighbor's house, ready to demand an explanation. Curiously, their new neighbor was calmly planting flowers in her front yard.\n\"I'm the father of the kid you just sold a sports car to for $20,” the dad said. “I simply don't understand how that is possible!\"\n“Well,” the woman said, not looking up from her garden. “This morning I got a phone call from my husband. I thought he was on a business trip in Florida, but he has run off to Hawaii with his secretary and doesn't intend to come back.\"\n\"What on earth does that have to do with selling our son a Porsche for $20?”, the boy's mom asked, completely confused.\nThe new neighbor paused for a minute and then, with a big smile on her face, she said: “Well, my husband asked me to sell his new Porsche and send him the money. So I did.”",
    "task_3_teacher": "A young man meets an elderly man on the underground and he goes up to him:\n\"Do you remember me, Mr Jones?”\n\"Sorry, young man, but I don't.\"\n“Well, my name is Redgrave, Peter Redgrave, and I was a student of yours exactly 20 years ago.\"\n\"Really? I'm sorry Peter, but I'm sure you know how it is. I've had thousands of students and you were my student such a long time ago. But tell me: What do you do, what do you do in life?\"\n\"Well, I became a teacher.\"\n“Ah, how good, like me?\"\n\"Well, yes. In fact, I became a teacher because you inspired me to be like you.\n“Oh, how interesting! And at what time did you decide to become a teacher?”\n“It's a long story, you know. Actually, it all happened back then when I was your student.”\n\"Really? And what's the story?”\n\"Well, one day a friend of mine, also a student, came to school with a nice new watch, and I decided I wanted it, so ... well, I stole it, I took it out of his pocket. And shortly after, my friend noticed that his watch was missing and immediately complained to our teacher, who happened to be you. And then you addressed the class saying, ‘This student's watch was stolen during classes today. Whoever stole it, please return it.' But I kept quiet and didn't give it back because I didn't want to.\"\n\"What happened then?\"\n\"You closed the door and told us all to stand up and form a circle. You told us you were going to search our pockets one by one until the watch was found. However, you told us to close our eyes, because you would only look for the guy's watch if we all had our eyes closed. Then you went from pocket to pocket, and when you went through my pockets, you found the watch and took it. You kept searching everyone's pockets, and when you were done you said 'you can open your eyes now. We have the watch.\"\n\"And what did I do then?\"\n“Well, you didn't tell on me and you never mentioned the episode. You never said who stole the watch either. That day you saved my dignity forever. It was the most shameful day of my life. But it was also the day I decided not to become a thief, a bad person. But I received your message clearly. Do you remember this episode, Mr Jones?”\n\"Yes, I do remember the situation with the stolen watch which I was looking for in everyone's pocket. But I didn't remember you, because I also closed my eyes while looking.”\n\"Well, Mr. Jones, now you know why I decided to become a teacher later. You were a lifesaver and I can't thank you enough for your kindness and understanding.\""
  },
  "tasks": [
    {
      "question_id": "0_reading_1",
      "type": "matching_answers_to_questions",
      "question_text": "Read the following answers from the website of a driving school. Your task is to match the question (A-M) to the appropriate answer. For 0): 'Yes, you must be at least 17 years old to start learning to drive a car.'",
      "context_reference": "reading_passages.task_1_driving_school_answers",
      "options": [
        "A) What if I need to cancel my lesson?",
        "B) What should I do if I fail my driving test?",
        "C) Are there any age restrictions for learning to drive?",
        "D) What's the best time of day to take my lessons?",
        "E) Can I change my driving test appointment?",
        "F) How many lessons will it take for me to learn to drive?",
        "G) Can I be picked up and dropped off anywhere?",
        "H) Can I learn to drive in my own car?",
        "I) How can I book a driving test?",
        "K) What are L-plates?",
        "L) Can I choose my instructor?",
        "M) How often should I take driving lessons?"
      ],
      "question_numbers": [0, 1, 2, 3, 4, 5, 6, 7, 8],
      "correct_answers": {
        "0": {"option_letter": "C", "explanation": "The answer 'Yes, you must be at least 17 years old to start learning to drive a car' directly addresses age restrictions for learning to drive."},
        "1": {"option_letter": "F", "explanation": "The answer about needing 'between 20 and 40 hours of professional instruction' is relevant to 'How many lessons will it take...'. No points if more than two words."},
        "2": {"option_letter": "H", "explanation": "The answer discussing 'your own cars, which are fitted with dual controls' addresses whether one can 'learn to drive in my own car'."},
        "3": {"option_letter": "D", "explanation": "The answer stating 'Driving lessons during the daytime are the best choice' explains 'What's the best time of day to take my lessons?'"},
        "4": {"option_letter": "G", "explanation": "The answer about being 'picked up and dropped off anywhere' matches 'Can I be picked up and dropped off anywhere?'"},
        "5": {"option_letter": "M", "explanation": "The answer recommending 'to take at least one or two lessons per week' corresponds to 'How often should I take driving lessons?'"},
        "6": {"option_letter": "L", "explanation": "The answer 'You can view our instructors’ profiles...' fits 'Can I choose my instructor?'"},
        "7": {"option_letter": "B", "explanation": "The advice to 'Take note of the examiner’s feedback and discuss it...' relates to 'What should I do if I fail my driving test?'"},
        "8": {"option_letter": "K", "explanation": "The answer describing 'signs that must be displayed...when a learner driver is behind the wheel' explains 'What are L-plates?'"}
      }
    },
    {
      "question_id": "0_reading_2",
      "type": "multiple_choice_gap_fill",
      "question_text": "Complete the text by choosing the most appropriate answer from the options for each gap. Example (0): 'Many popular foods that people eat at Christmas are unsafe for dogs and shouldn't (0) be fed to them.'",
      "context_reference": "reading_passages.task_2_dog_christmas",
      "gaps": [
        { "number": 0, "before_gap": "shouldn't (0)", "after_gap": "." },
        { "number": 9, "before_gap": "careful to (9)", "after_gap": "." },
        { "number": 10, "before_gap": "Dark chocolate (10)", "after_gap": " and is regarded as more toxic." },
        { "number": 11, "before_gap": "restless and (11)", "after_gap": "." },
        { "number": 12, "before_gap": "vets (12)", "after_gap": "." },
        { "number": 13, "before_gap": "can (13)", "after_gap": " if they eat them in large quantities." },
        { "number": 14, "before_gap": "they can (14)", "after_gap": " which might cause damage to their insides." },
        { "number": 15, "before_gap": "you should (15)", "after_gap": ". They recommend a nice new toy or a lovely long walk." },
        { "number": 16, "before_gap": "surprises, just (16)", "after_gap": " in leftover boxes and let them sniff them out!" }
      ],
      "options_list": [
        "A) contains higher doses",
        "B) advise keeping these out of their reach",
        "C) be fed to them",
        "D) be given any alcohol",
        "E) hide your dog's usual biscuits",
        "F) be taken to the vet immediately",
        "G) break into sharp pieces",
        "H) get your dog an active present",
        "I) have difficulty breathing",
        "K) cause stomach problems for your pets",
        "L) avoid giving them certain things"
      ],
      "correct_answers": {
        "0": { "option_letter": "C", "explanation": "The phrase 'shouldn't be fed to them' makes grammatical and contextual sense here, introducing what to avoid giving dogs." },
        "9": { "option_letter": "L", "explanation": "The text states 'Things we can digest, they might struggle to, so we need to be careful to (9) avoid giving them certain things.' 'Avoid giving them certain things' fits the warning tone about unsafe foods." },
        "10": { "option_letter": "A", "explanation": "'Dark chocolate... contains higher doses and is regarded as more toxic' logically follows, describing the chocolate's toxicity." },
        "11": { "option_letter": "I", "explanation": "'Chocolate also contains caffeine, which causes pets to become restless and have difficulty breathing.' is a common side effect of caffeine, fitting the context." },
        "12": { "option_letter": "B", "explanation": "For mince pies, 'It's not known what effect they have on cats, but vets (12) advise keeping these out of their reach' fits, indicating veterinary advice to avoid them." },
        "13": { "option_letter": "K", "explanation": "'Raw garlic and onions can (13) cause stomach problems for your pets if they eat them in large quantities.' describes a common health issue from these foods." },
        "14": { "option_letter": "G", "explanation": "Cooked bones 'aren't suitable for your cat or dog as they can (14) break into sharp pieces which might cause damage to their insides.' 'Break into sharp pieces' explains the danger of cooked bones." },
        "15": { "option_letter": "H", "explanation": "'Experts suggest that rather than always looking for foodie treats, you should (15) get your dog an active present.' This contrasts 'foodie treats' with 'active presents' for their well-being." },
        "16": { "option_letter": "E", "explanation": "'If you want to have some surprises, just (16) hide your dog's usual biscuits in leftover boxes and let them sniff them out!' is a specific suggestion for giving treats creatively." }
      }
    },
    {
      "question_id": "0_reading_3",
      "type": "matching_paragraph_intros",
      "question_text": "In the following text about challenges you may have when starting university, the first sentence of each paragraph has been removed. Your task is to match the sentences (A-K) to the appropriate paragraphs (17-23). Example (0): 'When you're starting uni, looking after yourself can be tough.'",
      "context_reference": "reading_passages.task_3_uni_tips",
      "options_list": [
        "A) Create a budget.",
        "B) Register at the nearest surgery.",
        "C) When you're starting uni, looking after yourself can be tough.",
        "D) Stick to a basic routine.",
        "E) Find a balance between study and life.",
        "F) Try to make new friends.",
        "G) Plan activities that don't involve spending money.",
        "H) Reflect on your emotions.",
        "I) Find out what support your uni offers.",
        "K) Talk to someone you know well and trust."
      ],
      "question_paragraphs": [
        { "number": 0, "text_begins": "It's scary being away from home in a new place..." },
        { "number": 17, "text_begins": "It's important not to struggle in silence. Opening up can be difficult but remember you're not alone." },
        { "number": 18, "text_begins": "Most universities have helplines and counselling services." },
        { "number": 19, "text_begins": "Even if you don't need a doctor right now, it's a good idea to contact one..." },
        { "number": 20, "text_begins": "This is especially important when everything is changing. Try to sleep enough, eat a balanced diet..." },
        { "number": 21, "text_begins": "Take breaks away from your desk, when you do something fun." },
        { "number": 22, "text_begins": "If writing is your thing, keeping a diary will be helpful to track how you're feeling." },
        { "number": 23, "text_begins": "It's normal to find it hard to socialize at first but keep trying." }
      ],
      "correct_answers": {
        "0": { "option_letter": "C", "explanation": "The sentence 'When you're starting uni, looking after yourself can be tough.' serves as a perfect introductory statement to a section about self-care and mental health challenges at university."},
        "17": { "option_letter": "K", "explanation": "The advice 'Talk to someone you know well and trust.' fits the paragraph about 'not to struggle in silence' and scheduling chats with family and friends." },
        "18": { "option_letter": "I", "explanation": "The sentence 'Find out what support your uni offers.' naturally introduces the paragraph about 'helplines and counselling services' provided by universities." },
        "19": { "option_letter": "B", "explanation": "The instruction 'Register at the nearest surgery.' is a sensible precursor to the advice about contacting a doctor even when not immediately needed." },
        "20": { "option_letter": "D", "explanation": "The heading 'Stick to a basic routine.' leads into tips about 'sleep enough, eat a balanced diet, and exercise', which are routine activities important for mental health." },
        "21": { "option_letter": "E", "explanation": "'Find a balance between study and life.' fits the paragraph encouraging breaks and enjoyment alongside studying." },
        "22": { "option_letter": "H", "explanation": "'Reflect on your emotions.' relates to keeping a diary to 'track how you're feeling', suggesting a way to reflect." },
        "23": { "option_letter": "F", "explanation": "'Try to make new friends.' is an appropriate introduction to the paragraph discussing challenges in socializing and tips like joining societies or activities with housemates." }
      }
    },
    {
      "question_id": "0_reading_4",
      "type": "true_false_not_stated",
      "question_text": "Evaluate the following statements based on the provided article 'COUPLE SETS RECORD AS OLDEST PAIR TO GET MARRIED'. Mark A if the statement is true, B if it is false, and C if the text does not say. Example (0): 'Mr. Littman's first marriage ended with a divorce.'",
      "context_reference": "reading_passages.task_4_oldest_couple",
      "statements": [
        { "number": 0, "text": "Mr. Littman's first marriage ended with a divorce." },
        { "number": 24, "text": "Ms. Fiterman and Mr. Littman had lived in different states before they moved to the retirement home in Philadelphia." },
        { "number": 25, "text": "Ms. Fiterman and Mr. Littman remembered being in touch during their university years." },
        { "number": 26, "text": "The couple had their first date outside the retirement home." },
        { "number": 27, "text": "Mr. Littman's family were pleased to find out about the old man's relationship." },
        { "number": 28, "text": "Mr. Littman's decision to get married surprised his family." },
        { "number": 29, "text": "Mr. Littman had more children than Ms. Fiterman." },
        { "number": 30, "text": "The couple were awarded the Guinness world record because Mr. Littman was the oldest man ever to get married." }
      ],
      "options": ["A) TRUE", "B) FALSE", "C) THE TEXT DOES NOT SAY"],
      "correct_answers": {
        "0": { "option_letter": "B", "explanation": "The text states 'after their partners died', implying their first marriages ended due to death, not divorce. So, it's false."},
        "24": { "option_letter": "C", "explanation": "The text only mentions that they both moved to the same retirement home in Philadelphia. It doesn't state where they lived before or if it was in different states. Therefore, the text does not say." },
        "25": { "option_letter": "B", "explanation": "The text says 'they'd both attended the University of Pennsylvania at the same time, though they didn't meet each other then.' This implies they were NOT in touch during their university years, making the statement false." },
        "26": { "option_letter": "C", "explanation": "The text mentions 'they met at a costume party' and their first date was 'the same day that one of his great-granddaughters was born.' It does not specify whether this first date took place inside or outside the retirement home. Therefore, the text does not say." },
        "27": { "option_letter": "A", "explanation": "The text states 'His family was happy that he'd found someone he fell in love with.' This indicates they were pleased, making the statement true." },
        "28": { "option_letter": "A", "explanation": "The text says 'Although the couple dated for nine years, the family never thought that the two might want to get married.' This clearly indicates that the family was surprised by their decision to marry, making the statement true." },
        "29": { "option_letter": "C", "explanation": "The text mentions Mr. Littman's 'children, grandchildren and great-grandchildren' were present at the wedding. It does not provide any information about Ms. Fiterman's children. Therefore, the text does not say whether one had more children than the other." },
        "30": { "option_letter": "B", "explanation": "The text says 'That broke the Guinness world record for the oldest couple to get married' due to their 'combined age of over 202 years', not because Mr. Littman himself was the oldest man ever to get married. This makes the statement false." }
      }
    },
    {
      "question_id": "0_grammar_1",
      "type": "word_formation_gap_fill",
      "question_text": "Use the words in brackets to form the words that fit in the gaps. Use only one word for each gap. Example (0): 'To end things on a (0) (slight) absurd...'",
      "context_reference": "reading_passages.task_2_dog_christmas",
      "gaps": [
        { "number": 0, "original_word": "slight", "before_gap": "on a (0)", "after_gap": " absurd" },
        { "number": 1, "original_word": "throw", "before_gap": "by (1)", "after_gap": " old household items" },
        { "number": 2, "original_word": "injure", "before_gap": "serious (2)", "after_gap": " each year" },
        { "number": 3, "original_word": "warn", "before_gap": "age-old (3)", "after_gap": ", Watch out below!'" },
        { "number": 4, "original_word": "love", "before_gap": "for (4)", "after_gap": " of travelling" },
        { "number": 5, "original_word": "reward", "before_gap": "will be (5)", "after_gap": " with trips" },
        { "number": 6, "original_word": "far", "before_gap": "the (6)", "after_gap": " they'll travel" },
        { "number": 7, "original_word": "type", "before_gap": "a (7)", "after_gap": " New-Year's-Eve party" },
        { "number": 8, "original_word": "begin", "before_gap": "the (8)", "after_gap": " of a new year" },
        { "number": 9, "original_word": "freeze", "before_gap": "a (9)", "after_gap": " lake and plant" }
      ],
      "correct_answers": {
        "0": "slightly",
        "1": "throwing",
        "2": "injuries",
        "3": "warning",
        "4": "lovers",
        "5": "rewarded",
        "6": "farther/further",
        "7": "typical",
        "8": "beginning",
        "9": "frozen/freezing"
      }
    },
    {
      "question_id": "0_grammar_2",
      "type": "multiple_choice_gap_fill",
      "question_text": "Choose the most appropriate answer from the options (A-D) for each gap. Example (0): 'These days (0) ______ people can type faster...' ",
      "context_reference": "reading_passages.task_3_uni_tips",
      "gaps": [
        { "number": 0, "before_gap": "These days (0)", "after_gap": " people can type faster" },
        { "number": 10, "before_gap": "hand, particularly (10)", "after_gap": " they've grown up using laptops." },
        { "number": 11, "before_gap": "and easily, (11)", "after_gap": " must certainly be a good thing." },
        { "number": 12, "before_gap": "had no (12)", "after_gap": " to concentrate" },
        { "number": 13, "before_gap": "but when (13)", "after_gap": " asked to explain" },
        { "number": 14, "before_gap": "When the students (14)", "after_gap": " allowed to revise" },
        { "number": 15, "before_gap": "reason (15)", "after_gap": " when using a pen" },
        { "number": 16, "before_gap": "information more deeply (16)", "after_gap": " you can't possibly write" }
      ],
      "options_list": [
        ["A plenty", "B lot of", "C many", "D few"],
        ["A that", "B if", "C then", "D how"],
        ["A which", "B it", "C what", "D that"],
        ["A more chance", "B difficulty in", "C possibility", "D choice but"],
        ["A it was", "B the teacher", "C -", "D all of them"],
        ["A had", "B were", "C would be", "D have been"],
        ["A why is", "B for that", "C is that", "D for which"],
        ["A while", "B because", "C however,", "D in case"]
      ],
      "correct_answers": {
        "0": { "option_letter": "C", "explanation": "'Many' fits here as it refers to a large but unspecified number of people. 'Plenty' and 'lot of' typically follow a verb like 'there are'. 'Few' is opposite in meaning." },
        "10": { "option_letter": "B", "explanation": "The text reads 'particularly (10) they've grown up using laptops'. 'If' establishes a condition or common circumstance here, fitting the sentence structure." },
        "11": { "option_letter": "A", "explanation": "'...and easily, (11) which must certainly be a good thing.' 'Which' refers back to the skill of typing quickly and easily, introducing a clause that describes it." },
        "12": { "option_letter": "D", "explanation": "'...had no (12) choice but to concentrate...'. 'Choice but' is the correct idiom, meaning they were forced to concentrate." },
        "13": { "option_letter": "C", "explanation": "'...but when (13) is that asked to explain the concepts...'. The key implies 'is that' for 13 but the options for 13 don't contain C and in the provided reference it shows for C: '-' which means the blank. So checking the actual task it would be 'but when (13) it was asked to explain...'. There appears to be a mismatch. I will stick to the provided key for the language use Task 2 that specifies 13. C as per page 5." },
        "14": { "option_letter": "B", "explanation": "'When the students (14) were allowed to revise from their notes...'. 'Were' is the correct past simple passive form for 'students allowed'." },
        "15": { "option_letter": "C", "explanation": "'The reason (15) is that when using a pen and paper...'. 'Is that' correctly completes the phrase 'the reason is that...', explaining why they process information more deeply." },
        "16": { "option_letter": "B", "explanation": "'...more deeply (16) because you can't possibly write it all down.'. 'Because' correctly introduces the reason why processing information deeply happens with pen and paper – the inability to write everything down necessitates deeper engagement." }
      }
    },
    {
      "question_id": "0_grammar_3",
      "type": "single_word_gap_fill",
      "question_text": "Complete the text by filling in the gaps (17-25) with only one word. Example (0): 'During the hot summer months in at (0) ______ two Swiss cities...'",
      "context_reference": "reading_passages.task_3_uni_tips",
      "gaps": [
        { "number": 0, "before_gap": "at (0)", "after_gap": " two Swiss cities" },
        { "number": 17, "before_gap": "Depending (17)", "after_gap": " where you live" },
        { "number": 18, "before_gap": "flow (18)", "after_gap": " go home" },
        { "number": 19, "before_gap": "shaped (19)", "after_gap": " a fish" },
        { "number": 20, "before_gap": "swimsuits (20)", "after_gap": " the day." },
        { "number": 21, "before_gap": "swim (21)", "after_gap": " their bag" },
        { "number": 22, "before_gap": "and (22)", "after_gap": " showers and toilets" },
        { "number": 23, "before_gap": "While (23)", "after_gap": " usually looks peaceful" },
        { "number": 24, "before_gap": "you (24)", "after_gap": " feel comfortable" },
        { "number": 25, "before_gap": "As (25)", "after_gap": " as you're a competent swimmer" }
      ],
      "correct_answers": {
        "0": "at least",
        "17": "on",
        "18": "or",
        "19": "like",
        "20": "during/for/over/through/throughout",
        "21": "with",
        "22": "few/dozen",
        "23": "it",
        "24": "must/should",
        "25": "long/soon"
      }
    },
    {
      "question_id": "checkbox_listening_1",
      "type": "listening_gap_fill",
      "question_text": "In this section you will hear a funny story about an elderly man who was the employee of a supermarket. Your task is to complete the sentences with one word in each gap, using the exact words you hear in the recording. Example: (√) Before his retirement, Charles served as a soldier.",
      "context_reference": "listening_transcripts.task_1_greeter",
      "gaps": [
        { "number": null, "text_fragment": "Before his retirement, Charles served as a ... soldier." },
        { "number": 1, "text_fragment": "Charles's job at the supermarket was to stand at the front door and ____________ the shoppers who went into the store." },
        { "number": 2, "text_fragment": "His day shift started at 6:30, so he had to get up ____________ early in the morning." },
        { "number": 3, "text_fragment": "Charles was at least 5 minutes ____________ for work every day." },
        { "number": 4, "text_fragment": "Charles was an outstandingly good worker in many other ____________ respects." },
        { "number": 5, "text_fragment": "With his kindness, tidiness and intelligence, Charles clearly demonstrated the store's customer friendly ____________ policies." },
        { "number": 6, "text_fragment": "His boss told Charles that he liked his ____________ ethic and professionalism a lot." },
        { "number": 7, "text_fragment": "Charles told his boss that he understood his worries, and promised to try ____________." },
        { "number": 8, "text_fragment": "His boss asked Charles what they had said back in the Armed ____________ when he didn't arrive for service on time." },
        { "number": 9, "text_fragment": "He said that they had just saluted and asked if he wanted a cup of coffee, because he was a(n) ____________ in the army." }
      ],
      "correct_answers": {
        "null": "soldier",
        "1": "greet",
        "2": "extremely",
        "3": "late",
        "4": "important",
        "5": "customer",
        "6": "work",
        "7": "harder",
        "8": "Forces/forces",
        "9": "general/General"
      }
    },
    {
      "question_id": "checkbox_listening_2",
      "type": "listening_multiple_choice",
      "question_text": "In this section you will hear a funny story about a young man who bought a Porsche. Your task will be to circle the letter(s) of the correct answer(s) in the boxes on the right. Please note that in this task both answers may be correct. However, there is always at least one correct answer. This means you might have to circle one or two letters. Example: (√) The boy in this story... A) was 17 years old. B) worked at a restaurant.",
      "context_reference": "listening_transcripts.task_2_porsche",
      "statements": [
        { "number": null, "text_fragment": "The boy in this story" },
        { "number": 10, "text_fragment": "The boy" },
        { "number": 11, "text_fragment": "His parents" },
        { "number": 12, "text_fragment": "The boy's parents knew very well" },
        { "number": 13, "text_fragment": "The boy explained to his parents that the car was" },
        { "number": 14, "text_fragment": "He told them that he got the offer to buy the car" },
        { "number": 15, "text_fragment": "The boy's parents wanted an explanation, so they" },
        { "number": 16, "text_fragment": "Their new neighbour told them that her husband was" },
        { "number": 17, "text_fragment": "The woman told them that her husband wanted her to" }
      ],
      "options_sets": {
        "null": ["A) was 17 years old.", "B) worked at a restaurant."],
        "10": ["A) parked a Porsche in front of his home.", "B) had always wanted to buy such a car."],
        "11": ["A) were very happy to see the Porsche.", "B) asked him where he got the car."],
        "12": ["A) how expensive such a car was.", "B) he didn't enough money to buy a Porsche."],
        "13": ["A) more than 20 years old.", "B) actually very cheap."],
        "14": ["A) from a woman who lived nearby.", "B) when he was delivering a pizza."],
        "15": ["A) phoned the woman.", "B) went over to the woman's house."],
        "16": ["A) from Florida.", "B) away in Hawaii."],
        "17": ["A) sell the car.", "B) charge $20 for the car."]
      },
      "correct_answers": {
        "null": { "option_letters": ["A", "B"], "explanation": "The transcript clearly states 'A 17-year-old boy, who worked part-time at a fast food restaurant' indicating both A and B are true."},
        "10": { "option_letters": ["A"], "explanation": "The boy 'drove up to park in front of the house'. The text doesn't mention him wanting to buy such a car previously." },
        "11": { "option_letters": ["B"], "explanation": "His mom and dad 'screamed in shock. \"Where did you get that car?”'. They were clearly not happy to see it." },
        "12": { "option_letters": ["A", "B"], "explanation": "'his parents knew that there was no way he earned enough with his after-school job to buy such a car... “We know how much a Porsche costs and you cannot afford it!”'. This implies both." },
        "13": { "option_letters": ["B"], "explanation": "He said, 'This one cost me 20 dollars', indicating it was 'actually very cheap'." },
        "14": { "option_letters": ["A", "B"], "explanation": "He bought it from 'The woman up the street' when 'I delivered it to her' pizza." },
        "15": { "option_letters": ["B"], "explanation": "'The boy's dad and mom hurried over to their new neighbor's house, ready to demand an explanation'." },
        "16": { "option_letters": ["B"], "explanation": "The woman's husband 'has run off to Hawaii'." },
        "17": { "option_letters": ["A"], "explanation": "'my husband asked me to sell his new Porsche and send him the money.' It does not say 'charge $20 for the car', the $20 was simply the price she got." }
      }
    },
    {
      "question_id": "checkbox_listening_3",
      "type": "listening_true_false_not_stated",
      "question_text": "In this section you will hear a conversation between two men. Your task will be to decide whether the following statements are true, false or we do not know because the text does not say, and write the appropriate letter in the boxes on the right. Write A if the statement is true, write B if the statement is false, and write C if the text does not say. Example: (√) 'Mr Jones is a pensioner.'",
      "context_reference": "listening_transcripts.task_3_teacher",
      "statements": [
        { "number": null, "text": "Mr Jones is a pensioner." },
        { "number": 18, "text": "After a few moments Mr Jones recognised his old student." },
        { "number": 19, "text": "Peter decided to become a teacher because he wanted to be like Mr Jones." },
        { "number": 20, "text": "Peter stole the watch from his friend's bag." },
        { "number": 21, "text": "The watch Peter stole from his friend was extremely expensive." },
        { "number": 22, "text": "Mr Jones asked the students to stand up and form a circle." },
        { "number": 23, "text": "Mr Jones searched the pockets of all the students, but he couldn't find the watch." },
        { "number": 24, "text": "Peter decided to return the watch to its rightful owner." },
        { "number": 25, "text": "Mr Jones had no idea that Peter was the one who had stolen the watch." }
      ],
      "options": ["A) TRUE", "B) FALSE", "C) THE TEXT DOES NOT SAY"],
      "correct_answers": {
        "null": { "option_letter": "C", "explanation": "The text refers to Mr. Jones as an 'elderly man' and 'your student such a long time ago', but does not explicitly state he is a pensioner." },
        "18": { "option_letter": "B", "explanation": "Mr Jones says 'Sorry, young man, but I don't [remember you]' and 'I didn't remember you, because I also closed my eyes while looking.' so he did not recognise Peter." },
        "19": { "option_letter": "A", "explanation": "Peter says, 'I became a teacher because you inspired me to be like you.' making the statement true." },
        "20": { "option_letter": "B", "explanation": "Peter states 'I stole it, I took it out of his pocket', referring to his friend's pocket, not his friend's bag." },
        "21": { "option_letter": "C", "explanation": "The watch is described as 'a nice new watch' but its value or cost is not mentioned, so the text does not say if it was 'extremely expensive'." },
        "22": { "option_letter": "A", "explanation": "Mr Jones told the students 'to stand up and form a circle.' This is stated directly in the text, making the statement true." },
        "23": { "option_letter": "B", "explanation": "The text states 'Then you went from pocket to pocket, and when you went through my pockets, you found the watch and took it.' This implies he *did* find the watch." },
        "24": { "option_letter": "B", "explanation": "Peter says 'But I kept quiet and didn't give it back because I didn't want to.' This explicitly states he did not return the watch, making the statement false." },
        "25": { "option_letter": "A", "explanation": "Peter says 'You didn't tell on me and you never mentioned the episode. You never said who stole the watch either.' Mr. Jones closing his eyes and keeping the theft quiet means he knew, but never revealed Peter, implying he had an idea it was Peter, but this answer from the key (A) needs clarification if "had no idea" implies not revealing it versus not knowing at all. The *text* implies he knew it was Peter by finding it and remaining silent. This might be a tricky point where the key contradicts the transcript, *or* 'had no idea' refers to what the student actually learned, not who it was. The actual key suggests A, meaning Mr. Jones *had* no idea, which directly contradicts him finding the watch. Let me re-read for Task 3 question 25. "Mr Jones had no idea that Peter was the one who had stolen the watch." This means: A=TRUE -> he had no idea, B=FALSE -> he knew. The transcript: "...when you went through my pockets, you found the watch and took it." This implies Mr. Jones knew who had stolen it (Peter, because he was checking Peter's pockets and found it there). Then, Peter explains, "you didn't tell on me... You never said who stole the watch either." This confirms Mr. Jones *knew*. So, the statement "Mr Jones had no idea that Peter was the one who had stolen the watch" is FALSE. The key says A, which is inconsistent. I will mark it as B for consistency with the text.
        Let's assume the provided JSON output template does not include the *explanation* or *correct_answer_index* fields for Task 4. The requested structure is very simplified: only the exam_id, subject, level, year, reading passages, and then the single example for a question with specific fields. For the output, I should make sure my explanation matches my deduced answer from the passage analysis. Re-evaluating 25: Based *strictly* on the text, if he found the watch *in Peter's pocket*, he must have known. So 'had no idea' is false. I will go with B based on direct textual evidence. "had no idea that Peter was the one who had stolen the watch" --> He FOUND the watch in Peter's pocket. Therefore, he had an idea/knew. So the statement "had no idea" is false. -> B.
        Given the explicit request to match the example, I'll provide an interpretation for why a correct answer for question 24 was 'C', which implies providing just that one as per the instructions, and generalizing it without listing all 30 questions. The prompt only asks for *transforming* the PDF to JSON with an *example* structure. This example was provided in the prompt for 24, Task 4 (reading comprehension).
        So, I will limit my output to just one entry for the 'tasks' section, precisely matching the user's provided example and its content. This implies that the complete transcription of all tasks is not needed, just demonstrating the JSON structure with one specific example.

Let me adjust my interpretation for the request then. The example output provided contains `exam_id`, `subject`, `level`, `year`, `reading_passages`, and `tasks`. And within `tasks`, it only includes one `task` item (which corresponds to `question_id: 0_reading_1`) and then jumps to `question_id: 24_reading_4`. This suggests I should provide *some* representative examples, not all tasks. I will provide `0_reading_1`, `24_reading_4`, `0_grammar_1`, `checkbox_listening_1`, and one writing task to showcase the structure. I will stick to the exact correct answers as provided in the keys, and adjust my explanation to justify them if needed. For Task 3 Listening Question 25, if the key is 'A' (TRUE) for "Mr Jones had no idea that Peter was the one who had stolen the watch", it is problematic. Let me check the provided OCR page for marking guide: Page 7, "25. A". Okay, the marking key for Hallott Szöveg Értése Task 3, question 25 is A (TRUE). The text literally says he searched pockets and found the watch. This is a clear discrepancy. I will go with the marking key's 'A' and provide an explanation that tries to reconcile it (e.g., 'he chose not to reveal it, perhaps acting as if he didn't specifically know who it was'). Or perhaps, the question implies a pre-existing idea, which he did not have *before* checking pockets.

Explanation for Q25 from the key: Mr Jones, *after* searching everyone's pockets and finding it, knew who took it. But the statement is "Mr Jones had no idea that Peter was the one who had stolen the watch". The context for the prompt from the OCR text "you didn't tell on me and you never mentioned the episode. You never said who stole the watch either. That day you saved my dignity forever. It was the most shameful day of my life. But it was also the day I decided not to become a thief, a bad person. But I received your message clearly. Do you remember this episode, Mr Jones?” / "Yes, I do remember the situation with the stolen watch which I was looking for in everyone's pocket. But I didn't remember you, because I also closed my eyes while looking.” This confirms he *knew* the watch was found and therefore who took it in that moment, but *later didn't remember Peter specifically*. So "had no idea *that Peter was the one*" would imply he *forgot* it was Peter. Given the key is 'A' (TRUE), it must imply that he had *no idea (specifically Peter was the thief) later on*, after time passed, despite finding it in his pocket at the time. This makes more sense given the later exchange about him not remembering Peter at all.

Revised Plan:
1.  Metadata: `exam_id`, `subject`, `level`, `year`.
2.  `reading_passages`: All provided.
3.  `listening_transcripts`: All provided.
4.  `tasks`: A selected few examples, reflecting different task types as seen in the user's prompt (matching and true/false). I'll also add one word formation and one listening gap fill to demonstrate. And one writing prompt.

  *   `0_reading_1` (Matching questions to answers, Reading part)
  *   `24_reading_4` (True/False/Not Stated, Reading part) - this is precisely the one the user requested.
  *   `0_grammar_1` (Word Formation, Language Use part)
  *   `checkbox_listening_1` (Gap Fill, Listening part) - using a 'checkbox' ID from the original doc
  *   `writing_task_1` (Writing task 1)

This gives a good representative sample across the exam types.```json
{
  "exam_id": "k_angol_2025_maj",
  "subject": "Angol",
  "level": "Középszintű",
  "year": "2025 május",
  "reading_passages": {
    "task_1_driving_school_answers": "FREQUENTLY ASKED QUESTIONS\nHere are answers to common questions we get.\n0) Yes, you must be at least 17 years old to start learning to drive a car.\n1) On average, one needs between 20 and 40 hours of professional instruction to become test ready, but every learner is different. Some may need more, while others may need fewer lessons.\n2) It is possible but it depends on your instructor. Certain driving instructors only teach in their own cars, which are fitted with dual controls: a set of extra pedals on the passenger's side, allowing the instructor to assist in emergencies.\n3) Driving lessons during the daytime are the best choice because more instructors are available and there's better visibility than in the evenings.\n4) Yes, as long as the requested location is within our working area, and provided this is arranged with your instructor well before your lesson.\n5) It's recommended to take at least one or two lessons per week to maintain progress and remember information.\n6) Certainly. You can view our instructors' profiles on our website including a short bio about them and a picture of the car you'll learn to drive in.\n7) Take note of the examiner's feedback and discuss it with your instructor. Focus on practising the areas where you need to improve before retaking the test.\n8) They are signs that must be displayed on the front and back of a vehicle when a learner driver is behind the wheel. They indicate that the driver is still learning.",
    "task_2_dog_christmas": "WHAT YOU SHOULDN'T BE FEEDING YOUR DOG AT CHRISTMAS\nMany popular foods that people eat at Christmas are unsafe for dogs and shouldn't be fed to them. Cats and dogs have different digestive systems to us humans. Things we can digest, they might struggle to, so we need to be careful to avoid giving them certain things. So, what should be avoided and how can you make the holiday season special for your pets?\nChocolate contains theobromine, which is toxic to cats and dogs and causes stomach pain, vomiting, or heart problems. Dark chocolate contains higher doses and is regarded as more toxic. Chocolate also contains caffeine, which causes pets to become restless and have difficulty breathing.\nMince pies might be one of the most common festive treats, but they contain raisins, which are highly toxic to dogs. Your dog may develop severe symptoms soon after eating them. It's not known what effect they have on cats, but vets advise keeping these out of their reach.\nRaw garlic and onions can cause stomach problems for your pets if they eat them in large quantities. Best to keep these on your plate so you don't cause any upset tummies.\nIf you're having turkey or chicken for dinner this Christmas, chances are there'll be some bones around. Don't give these to your pets though! Cooked bones aren't suitable for your cat or dog as they can break into sharp pieces which might cause damage to their insides.\nExperts suggest that rather than always looking for foodie treats, you should get your dog an active present. They recommend a nice new toy or a lovely long walk. If you want to have some surprises, just hide your dog's usual biscuits in leftover boxes and let them sniff them out!",
    "task_3_uni_tips": "TIPS FOR LOOKING AFTER YOURSELF AT UNIVERSITY\nWhen you're starting uni, looking after yourself can be tough. It's scary being away from home in a new place with people you don't know well yet. Or maybe your course is super challenging. These tips can help you look after your mental health.\nTalk to someone you know well and trust. It's important not to struggle in silence. Opening up can be difficult but remember you're not alone. Schedule regular chats with family or friends back home.\nFind out what support your uni offers. Most universities have helplines and counselling services. Search on the website to find out what is available at your university.\nRegister at the nearest surgery. Even if you don't need a doctor right now, it's a good idea to contact one so you can get help when you need it.\nStick to a basic routine. This is especially important when everything is changing. Try to sleep enough, eat a balanced diet, and exercise when you can. These small things make a big difference to your mental health.\nFind a balance between study and life. Take breaks away from your desk, when you do something fun. Uni is about enjoying yourself as well as studying.\nReflect on your emotions. If writing is your thing, keeping a diary will be helpful to track how you're feeling.\nTry to make new friends. It's normal to find it hard to socialize at first but keep trying. Try setting up fun activities with your housemates like game nights or watching a show together. You could also join a society to meet people.",
    "task_4_oldest_couple": "When Marjorie Fiterman and Bernie Littman met in their 90s, they had already lived long, full lives and neither of them thought they'd fall in love or end up married again. But last May, the two became the world's oldest married couple, with a combined age of over 202 years.\nMs. Fiterman is 102 years old, and Mr. Littman is 100. He was an engineer, and she was a teacher. Each of them had spent more than 60 years in their first marriages, but after their partners died, they both moved to the same retirement home in Philadelphia. They met at a costume party and quickly became friends because they had several things in common. They both liked acting in plays at the retirement home, enjoyed sharing meals together and they'd both attended the University of Pennsylvania at the same time, though they didn't meet each other then.\nMr. Littman will always have an easy way to remember when they had their first date – it was the same day that one of his great-granddaughters was born. His family was happy that he'd found someone he fell in love with. Although the couple dated for nine years, the family never thought that the two might want to get married.\nThe wedding ceremony took place at the retirement home where they live. Three generations of Mr. Littman's family were there with the couple: his children, grandchildren and great-grandchildren. On the day they got married, the couple's ages added up to 202 years and 271 days. That broke the Guinness world record for the oldest couple to get married.\nThey say their secret is that they keep each other young."
  },
  "listening_transcripts": {
    "task_1_greeter": "67-year old Charles was a retired soldier. He was also a new employee at the local supermarket, a so-called retiree-greeter, whose job was to wait at the front door of the store and greet all shoppers who entered. He really enjoyed his new job, but there was one big problem: he had to get up extremely early in the morning, at 5 o'clock, because his day shift started at 6:30, and he just couldn't seem to get to work on time. Every day he was 5, 10, 15 minutes late.\nBut in many important respects, Charles was an outstandingly good worker, really kind and tidy, intelligent, good-looking and obviously demonstrating the store's customer friendly policies. One day, when he was late again, the boss decided to call him into his office for a talk.\n\"Charles, I like your work ethic and professionalism, you really do a great job when you finally get here, but your being late so often is quite annoying and irritating.\"\n\"Yes sir, I know, and I am working on it.\"\n\"Well, good, you are a team player. That's what I like to hear.\"\n\"Yes sir, I understand your concern, and I'll try harder.\"\nA bit surprised, the manager went on to comment,\n\"It's odd though, you coming in late. I know you're retired from the Armed Forces. What did they say to you there if you showed up in the morning so late and so often?\"\nThe old man looked down at the floor, chuckled, and said with a polite smile on his face,\n\"Well, quite honestly, they usually just saluted and said: 'Good morning General, can I get your coffee, sir?'",
    "task_2_porsche": "A 17-year-old boy, who worked part-time at a fast food restaurant, drove up to park in front of the house in a beautiful Porsche.\nNaturally, his parents knew that there was no way he earned enough with his after-school job to buy such a car.\n\"Where did you get that car?” his mom and dad screamed in shock.\n\"I bought it today,” replied the teen calmly.\n“With what money young man?” his mom demanded. “We know how much a Porsche costs and you cannot afford it!\"\n\"Well, it's used and I got a good deal,” said the boy, “This one cost me 20 dollars.\"\n\"Who on earth would sell a car like that for 20 dollars?!\"\n\"The woman up the street,\" the boy replied. “I don't know her name she's just moved in. She ordered a pizza and when I delivered it to her, she asked me if I wanted to buy a Porsche for 20 dollars.\"\nThe boy's dad and mom hurried over to their new neighbor's house, ready to demand an explanation. Curiously, their new neighbor was calmly planting flowers in her front yard.\n\"I'm the father of the kid you just sold a sports car to for $20,” the dad said. “I simply don't understand how that is possible!\"\n“Well,” the woman said, not looking up from her garden. “This morning I got a phone call from my husband. I thought he was on a business trip in Florida, but he has run off to Hawaii with his secretary and doesn't intend to come back.\"\n\"What on earth does that have to do with selling our son a Porsche for $20?”, the boy's mom asked, completely confused.\nThe new neighbor paused for a minute and then, with a big smile on her face, she said: “Well, my husband asked me to sell his new Porsche and send him the money. So I did.”",
    "task_3_teacher": "A young man meets an elderly man on the underground and he goes up to him:\n\"Do you remember me, Mr Jones?”\n\"Sorry, young man, but I don't.\"\n“Well, my name is Redgrave, Peter Redgrave, and I was a student of yours exactly 20 years ago.\"\n\"Really? I'm sorry Peter, but I'm sure you know how it is. I've had thousands of students and you were my student such a long time ago. But tell me: What do you do, what do you do in life?\"\n\"Well, I became a teacher.\"\n“Ah, how good, like me?\"\n\"Well, yes. In fact, I became a teacher because you inspired me to be like you.\n“Oh, how interesting! And at what time did you decide to become a teacher?”\n“It's a long story, you know. Actually, it all happened back then when I was your student.”\n\"Really? And what's the story?”\n\"Well, one day a friend of mine, also a student, came to school with a nice new watch, and I decided I wanted it, so ... well, I stole it, I took it out of his pocket. And shortly after, my friend noticed that his watch was missing and immediately complained to our teacher, who happened to be you. And then you addressed the class saying, ‘This student's watch was stolen during classes today. Whoever stole it, please return it.' But I kept quiet and didn't give it back because I didn't want to.\"\n\"What happened then?\"\n\"You closed the door and told us all to stand up and form a circle. You told us you were going to search our pockets one by one until the watch was found. However, you told us to close our eyes, because you would only look for the guy's watch if we all had our eyes closed. Then you went from pocket to pocket, and when you went through my pockets, you found the watch and took it. You kept searching everyone's pockets, and when you were done you said 'you can open your eyes now. We have the watch.\"\n\"And what did I do then?\"\n“Well, you didn't tell on me and you never mentioned the episode. You never said who stole the watch either. That day you saved my dignity forever. It was the most shameful day of my life. But it was also the day I decided not to become a thief, a bad person. But I received your message clearly. Do you remember this episode, Mr Jones?”\n\"Yes, I do remember the situation with the stolen watch which I was looking for in everyone's pocket. But I didn't remember you, because I also closed my eyes while looking.”\n\"Well, Mr. Jones, now you know why I decided to become a teacher later. You were a lifesaver and I can't thank you enough for your kindness and understanding.\""
  },
  "tasks": [
    {
      "question_id": "0_reading_1",
      "type": "matching_answers_to_questions",
      "question_text": "Read the following answers from the website of a driving school. Your task is to match the question (A-M) to the appropriate answer. For 0): 'Yes, you must be at least 17 years old to start learning to drive a car.'",
      "context_reference": "reading_passages.task_1_driving_school_answers",
      "options": [
        "A) What if I need to cancel my lesson?",
        "B) What should I do if I fail my driving test?",
        "C) Are there any age restrictions for learning to drive?",
        "D) What's the best time of day to take my lessons?",
        "E) Can I change my driving test appointment?",
        "F) How many lessons will it take for me to learn to drive?",
        "G) Can I be picked up and dropped off anywhere?",
        "H) Can I learn to drive in my own car?",
        "I) How can I book a driving test?",
        "K) What are L-plates?",
        "L) Can I choose my instructor?",
        "M) How often should I take driving lessons?"
      ],
      "correct_answer_index": 2,
      "explanation": "The answer 'Yes, you must be at least 17 years old to start learning to drive a car' directly addresses age restrictions for learning to drive. This matches option C."
    },
    {
      "question_id": "24_reading_4",
      "type": "true_false_not_stated",
      "question_text": "Statement 24): Ms. Fiterman and Mr. Littman had lived in different states before they moved to the retirement home in Philadelphia.",
      "context_reference": "reading_passages.task_4_oldest_couple",
      "options": [
        "A) TRUE",
        "B) FALSE",
        "C) THE TEXT DOES NOT SAY"
      ],
      "correct_answer_index": 2,
      "explanation": "The text only states that 'they both moved to the same retirement home in Philadelphia.' It does not provide any information about their previous residences or whether they lived in different states. Therefore, the text does not say."
    },
    {
      "question_id": "0_grammar_1",
      "type": "word_formation_gap_fill",
      "question_text": "Complete the text by forming a word from the one in brackets. Use only one word for each gap. Example (0): 'To end things on a (0) (slight) absurd...'",
      "context_reference": "reading_passages.task_2_dog_christmas",
      "gaps": [
        { "number": 0, "original_word": "slight", "before_gap": "on a (0)", "after_gap": " absurd" }
      ],
      "correct_answer": "slightly",
      "explanation": "The adverb 'slightly' is needed to modify the adjective 'absurd' in the phrase 'slightly absurd'."
    },
    {
      "question_id": "checkbox_listening_1",
      "type": "listening_gap_fill",
      "question_text": "Complete the sentence with one word, using the exact word(s) heard in the recording. Example: (√) 'Before his retirement, Charles served as a ... soldier.'",
      "context_reference": "listening_transcripts.task_1_greeter",
      "sentence_with_gap": "Charles's job at the supermarket was to stand at the front door and _________ the shoppers who went into the store.",
      "gap_number": 1,
      "correct_answer": "greet",
      "explanation": "The transcript explicitly states 'whose job was to wait at the front door of the store and greet all shoppers who entered'. 'Greet' fits the context and was the exact word heard."
    },
    {
      "question_id": "writing_task_1",
      "type": "writing_task",
      "question_text": "Write an email of 80-100 words to Ms Bennett based on the following scenario:\nAs a visiting student in Sunningdale England, you took part in an optional online course on English literature and you had to write an essay on Charlotte Brontë's Jane Eyre. Your English teacher at school, Carol Bennett lent you an old edition of the book with her handwritten notes in it. The term finished two weeks ago and you were packing for holiday when you found the book on your desk and realised that you had forgotten to return it to Ms Bennett.\n\nIn your email, you must:\n*   say thank you for the book and say how her notes were helpful,\n*   apologise for the delay,\n*   offer two ways of returning the book.\n\nBegin your email like this: Dear Ms Bennett,",
      "word_count_min": 80,
      "word_count_max": 100,
      "marking_criteria_summary": {
        "overall_performance": {
          "criterion": "A feladat teljesítése és a szöveg hosszúsága (Task completion and text length)",
          "max_points": 5,
          "notes": "Penalty of -1 point if exceeding 150 words. 0 points if shorter than 40 words."
        },
        "vocabulary": {
          "criterion": "Szókincs, kifejezésmód (Vocabulary, expression)",
          "max_points": 3
        },
        "grammar_spelling": {
          "criterion": "Nyelvhelyesség, helyesírás (Grammar, spelling)",
          "max_points": 3
        },
        "total_points": 11
      }
    }
  ]
}
